{
        "projects": [
                {
                        "id": 9,
                        "title": "Mediawali: High-Traffic News Portal",
                        "img": "projectImage/mediawali.png",
                        "desc": "A high-performance news and media platform optimized for speed and SEO. Built with a custom CMS architecture to handle rapid content publishing and large-scale concurrent user traffic. Tech Stack: WordPress, Custom PHP, Advanced Custom Fields (ACF).",
                        "url": "https://mediawali.com/"
                },
                {
                        "id": 8,
                        "title": "Solar Connect India: Enterprise Service Portal",
                        "img": "projectImage/solarconnectindia.png",
                        "desc": "A comprehensive service platform for the solar energy sector. Features a Custom Solar Management Plugin built from scratch to track technical project specifications, lead lifecycles, and installation metrics. Tech Stack: WordPress, PHP (Custom Plugin Dev), JavaScript, MySQL.",
                        "url": "https://solarconnectindia.in/"
                },
                {
                        "id": 7,
                        "title": "Print-on-Demand E-commerce Engine",
                        "img": "projectImage/printepalette.png",
                        "desc": "A specialized e-commerce platform developed for Hatwaliya. It features a custom design-upload module, automated order processing logic, and secure payment gateway integration for a seamless \"design-to-delivery\" workflow. Tech Stack: Django, ReactJS, PostgreSQL, Razorpay API.",
                        "url": "https://github.com/shyanukant/hidigitalecommerce"
                },
                
                {
                        "id": 6,
                        "title": "Intelligent WhatsApp Business Agent",
                        "img": "projectImage/waflow.png",
                        "desc": "A production-ready WhatsApp AI agent LLM and custom data to automate customer support. It handles intelligent query resolution and schedules tasks without human intervention. Tech Stack: React, Express.js, Openrouter, Pinecore, Wasender, Supabase, Flutterwave Payment gatewate, Replit.",
                        "url": ""
                },
                {
                        "id": 5,
                        "title": "Autonomous AI Voice Agent Workflow",
                        "img": "",
                        "desc": "An advanced automation system designed to handle real-time lead qualification. It uses voice-to-text and LLM processing to interact with customers, qualify potential leads, and automatically book appointments in a CRM. Tech Stack: n8n, OpenAI Whisper, Gemini API, Webhooks.",
                        "url": ""
                },
                {
                        "id": 4,
                        "title": "Clothes Store",
                        "img": "projectImage/clothes-store.jpeg",
                        "desc": "This innovative web application is built on a solid tech stack, featuring Next.js for front-end development, Medusa.js for e-commerce capabilities, and a reliable back-end powered by Node.js and PostgreSQL.",
                        "url": "https://github.com/shyanukant/geekWearStore-Medusa"
                },
                {
                        "id": 3,
                        "title": "Social Media Content Creator",
                        "img": "projectImage/social-media.jpeg",
                        "desc": "This application is designed to empower users in generating content for multiple social media platforms, complete with customized images featuring their logo, website, and handle. Users can establish their brand identity before easily creating compelling content.",
                        "url": "https://github.com/shyanukant/toolverse"
                },
                {
                        "id": 2,
                        "title": "Auto to Text API",
                        "img": "projectImage/audio-text.jpeg",
                        "desc": "An audio-to-text conversion API using FastAPI with the Whixper model from OpenAI. I've integrated Gmail login for sending transcribed text files, and I'm implementing FastAPI token authentication, Pedantic schema, and Alembic for database migration.",
                        "url": "https://github.com/shyanukant/transcribeapi"
                }
               
        ],
        "services": [
                {
                        "title": "Custom Web Application Development",
                        "description": "Build scalable, user-friendly web applications using Django, Flask, and React. From dashboards to interactive tools, I create robust web apps tailored to your needs."
                },
                {
                        "title": "AI & Automation Solutions",
                        "description": "Turn your ideas into intelligent tools using OpenAI, LangChain, and FastAPI. I develop smart systems like AI content generators, chatbots, and automation workflows."
                },
                {
                        "title": "Data Analysis & Visualization",
                        "description": "Unlock insights from your data with Python, Pandas, NumPy, and Scikit-learn. I provide end-to-end solutions—from cleaning and exploration to charts and predictive models."
                },
                {
                        "title": "API Development & Integration",
                        "description": "Build and integrate powerful APIs using Django REST Framework and FastAPI. From Gmail login and transcription to image processing, I deliver secure, scalable backend solutions."
                }
        ]
}